Show / Hide Table of Contents
Class Hanging
Representing hanging in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
Hanging
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class Hanging : Reinforcement
Constructors
Improve this Doc   View Source
Hanging()
Constructor
Declaration
public Hanging()
Properties
Improve this Doc   View Source
Angle
Angle between braches
Declaration
public double Angle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BottomLength
Length of inside part of anchor
Declaration
public double BottomLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Diameter
Diameter o reinforcement
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
Declaration
public double DiameterOfMandrel { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EdgeOrientationType
Edge orientation type
Declaration
public EdgeOrientationType EdgeOrientationType { get; set; }
Property Value
 Type |  Description
 EdgeOrientationType
Improve this Doc   View Source
EndsType
End type of the reinforcement bar - same for both ends
Declaration
public LongReinfEndType EndsType { get; set; }
Property Value
 Type |  Description
 LongReinfEndType
Improve this Doc   View Source
HangingType
Type of hanging
Declaration
public HangingType HangingType { get; set; }
Property Value
 Type |  Description
 HangingType
Improve this Doc   View Source
LegsLength
Length of legs
Declaration
public double LegsLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component of hanging
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterEdge
Master edge of hanging
Declaration
public ReferenceElement MasterEdge { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
PositionOnEdge
Position on edge
Declaration
public double PositionOnEdge { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Radius
Radius of top loop
Declaration
public double Radius { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UpperLength
Length of upper part of hanging
Declaration
public double UpperLength { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source